demo_data.py

In [2]:
import sqlite3

In [3]:
con = sqlite3.connect('demo_data.sqlite3')

In [4]:
curs = con.cursor()

In [5]:
statement = """CREATE TABLE demo (
                s VARCHAR(10),
                x INT,
                y INT);
            """

In [6]:
curs.execute(statement)

OperationalError: table demo already exists

In [7]:
statement = """
            INSERT INTO demo VALUES
                ('g', 3, 9),
                ('v', 5, 7),
                ('f', 8, 7);
            """

In [8]:
curs.execute(statement)

In [9]:
query = 'SELECT COUNT(*) FROM demo;'

In [10]:
curs.execute(query).fetchall()

[(3,)]

In [11]:
query = 'SELECT COUNT(*) FROM demo WHERE x >= 5 AND y >=5;'

In [12]:
curs.execute(query).fetchall()

[(2,)]

In [13]:
query = 'SELECT COUNT(DISTINCT y) FROM demo;'

In [14]:
curs.execute(query).fetchall()

[(2,)]

In [16]:
con.commit()

In [31]:
import sqlite3

con = sqlite3.connect('northwind_small.sqlite3')

curs = con.cursor()

In [32]:
curs.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;").fetchall()

[('Category',),
 ('Customer',),
 ('CustomerCustomerDemo',),
 ('CustomerDemographic',),
 ('Employee',),
 ('EmployeeTerritory',),
 ('Order',),
 ('OrderDetail',),
 ('Product',),
 ('Region',),
 ('Shipper',),
 ('Supplier',),
 ('Territory',)]

In [33]:
curs.execute('SELECT sql FROM sqlite_master WHERE name="Customer";').fetchall()

[('CREATE TABLE "Customer" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "CompanyName" VARCHAR(8000) NULL, \n  "ContactName" VARCHAR(8000) NULL, \n  "ContactTitle" VARCHAR(8000) NULL, \n  "Address" VARCHAR(8000) NULL, \n  "City" VARCHAR(8000) NULL, \n  "Region" VARCHAR(8000) NULL, \n  "PostalCode" VARCHAR(8000) NULL, \n  "Country" VARCHAR(8000) NULL, \n  "Phone" VARCHAR(8000) NULL, \n  "Fax" VARCHAR(8000) NULL \n)',)]

In [37]:
query = 'SELECT ProductName, UnitPrice FROM Product ORDER BY UnitPrice DESC LIMIT 10;'

curs.execute(query).fetchall()

[('Côte de Blaye', 263.5),
 ('Thüringer Rostbratwurst', 123.79),
 ('Mishi Kobe Niku', 97),
 ("Sir Rodney's Marmalade", 81),
 ('Carnarvon Tigers', 62.5),
 ('Raclette Courdavault', 55),
 ('Manjimup Dried Apples', 53),
 ('Tarte au sucre', 49.3),
 ('Ipoh Coffee', 46),
 ('Rössle Sauerkraut', 45.6)]

In [41]:
query = 'SELECT AVG(HireDate-Birthdate) FROM Employee;'

curs.execute(query).fetchall()

[(37.22222222222222,)]

In [74]:
query = """
        SELECT City, AVG(HireDate-Birthdate)
        FROM Employee
        GROUP BY City
        """
curs.execute(query).fetchall()

[('Kirkland', 29.0),
 ('London', 32.5),
 ('Redmond', 56.0),
 ('Seattle', 40.0),
 ('Tacoma', 40.0)]

In [56]:
curs.execute('SELECT sql FROM sqlite_master WHERE name="Product";').fetchall()

[('CREATE TABLE "Product" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "ProductName" VARCHAR(8000) NULL, \n  "SupplierId" INTEGER NOT NULL, \n  "CategoryId" INTEGER NOT NULL, \n  "QuantityPerUnit" VARCHAR(8000) NULL, \n  "UnitPrice" DECIMAL NOT NULL, \n  "UnitsInStock" INTEGER NOT NULL, \n  "UnitsOnOrder" INTEGER NOT NULL, \n  "ReorderLevel" INTEGER NOT NULL, \n  "Discontinued" INTEGER NOT NULL \n)',)]

In [55]:
curs.execute('SELECT sql FROM sqlite_master WHERE name="Supplier";').fetchall()

[('CREATE TABLE "Supplier" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "CompanyName" VARCHAR(8000) NULL, \n  "ContactName" VARCHAR(8000) NULL, \n  "ContactTitle" VARCHAR(8000) NULL, \n  "Address" VARCHAR(8000) NULL, \n  "City" VARCHAR(8000) NULL, \n  "Region" VARCHAR(8000) NULL, \n  "PostalCode" VARCHAR(8000) NULL, \n  "Country" VARCHAR(8000) NULL, \n  "Phone" VARCHAR(8000) NULL, \n  "Fax" VARCHAR(8000) NULL, \n  "HomePage" VARCHAR(8000) NULL \n)',)]

In [57]:
query = """
        SELECT ProductName, UnitPrice, CompanyName
        FROM Product
        INNER JOIN Supplier ON Product.SupplierID = Supplier.Id
        ORDER BY UnitPrice DESC
        LIMIT 10
        """

curs.execute(query).fetchall()

[('Côte de Blaye', 263.5, 'Aux joyeux ecclésiastiques'),
 ('Thüringer Rostbratwurst', 123.79, 'Plutzer Lebensmittelgroßmärkte AG'),
 ('Mishi Kobe Niku', 97, 'Tokyo Traders'),
 ("Sir Rodney's Marmalade", 81, 'Specialty Biscuits, Ltd.'),
 ('Carnarvon Tigers', 62.5, 'Pavlova, Ltd.'),
 ('Raclette Courdavault', 55, 'Gai pâturage'),
 ('Manjimup Dried Apples', 53, "G'day, Mate"),
 ('Tarte au sucre', 49.3, "Forêts d'érables"),
 ('Ipoh Coffee', 46, 'Leka Trading'),
 ('Rössle Sauerkraut', 45.6, 'Plutzer Lebensmittelgroßmärkte AG')]

In [58]:
curs.execute('SELECT sql FROM sqlite_master WHERE name="Category";').fetchall()

[('CREATE TABLE "Category" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "CategoryName" VARCHAR(8000) NULL, \n  "Description" VARCHAR(8000) NULL \n)',)]

In [66]:
query = """
        SELECT CategoryName, COUNT(Product.Id)
        FROM Category
        INNER JOIN Product ON Category.Id = Product.CategoryID
        GROUP BY CategoryName
        ORDER BY COUNT(Product.Id) DESC
        """

curs.execute(query).fetchall()

[('Confections', 13),
 ('Beverages', 12),
 ('Condiments', 12),
 ('Seafood', 12),
 ('Dairy Products', 10),
 ('Grains/Cereals', 7),
 ('Meat/Poultry', 6),
 ('Produce', 5)]

In [76]:
curs.execute('SELECT sql FROM sqlite_master WHERE name="Employee";').fetchall()

[('CREATE TABLE "Employee" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "LastName" VARCHAR(8000) NULL, \n  "FirstName" VARCHAR(8000) NULL, \n  "Title" VARCHAR(8000) NULL, \n  "TitleOfCourtesy" VARCHAR(8000) NULL, \n  "BirthDate" VARCHAR(8000) NULL, \n  "HireDate" VARCHAR(8000) NULL, \n  "Address" VARCHAR(8000) NULL, \n  "City" VARCHAR(8000) NULL, \n  "Region" VARCHAR(8000) NULL, \n  "PostalCode" VARCHAR(8000) NULL, \n  "Country" VARCHAR(8000) NULL, \n  "HomePhone" VARCHAR(8000) NULL, \n  "Extension" VARCHAR(8000) NULL, \n  "Photo" BLOB NULL, \n  "Notes" VARCHAR(8000) NULL, \n  "ReportsTo" INTEGER NULL, \n  "PhotoPath" VARCHAR(8000) NULL \n)',)]

In [77]:
curs.execute('SELECT sql FROM sqlite_master WHERE name="EmployeeTerritory";').fetchall()

[('CREATE TABLE "EmployeeTerritory" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "EmployeeId" INTEGER NOT NULL, \n  "TerritoryId" VARCHAR(8000) NULL \n)',)]

In [83]:
query = """
        SELECT FirstName, LastName, COUNT(EmployeeTerritory.Id) AS Territories
        FROM Employee
        INNER JOIN EmployeeTerritory ON Employee.Id = EmployeeTerritory.EmployeeId
        GROUP BY Employee.Id
        ORDER BY Territories DESC
        """

curs.execute(query).fetchall()

[('Robert', 'King', 10),
 ('Andrew', 'Fuller', 7),
 ('Steven', 'Buchanan', 7),
 ('Anne', 'Dodsworth', 7),
 ('Michael', 'Suyama', 5),
 ('Janet', 'Leverling', 4),
 ('Laura', 'Callahan', 4),
 ('Margaret', 'Peacock', 3),
 ('Nancy', 'Davolio', 2)]

The relationship between Employee and Territory is many to many. They are not directly connected via the schema. Logically, given a large enough company multiple personel may be assigned to a single territory and vica versa, if the company is small a sigle employee may be assigned multiple territories. 

MongoDB may be appropriate in a situation that requires ad hoc data insertion and has no urgency for retrieval, and or is working with large amounts of unstructed data. It is invaluable in situations where the user cannot pre define the schema. There are few limitations placed upon the user to organize their data, which makes it very easy to upload. If done in an unstructured manner, the data will be difficult to organize and retrieve efficiently. To avoid this one must use proper indexing. 

MongoDB is not appropriate for use where stability is of the utmost importance. A relational database such as MySQL would serve better, as it is a mature platform with widespread adoption. Getting technical support is trivial and operational memory requirements are lower for those who are infrastructure limited. Also, MongoDB doesn't support joins in a straightforward fashion. Doing so is computationally expensive and one is better off using a structured database instead. 

NewSQL is an evolved form of SQL currently being developed to solve the lingering problems with the legacy structured database paradigm, while retaining its best attributes. The chief issue it aims to solve being scalability, meaning the database should continue functioning properly as its contents increase. The end goal is to create a system that will adhere to the principles of ACID (Atomicity, Consistency, Isolation, Durability) while scaling without an exponential increase in compute power necessary.

In [17]:
!jupyter nbconvert --to script sql.ipynb

[NbConvertApp] Converting notebook sql.ipynb to script
[NbConvertApp] Writing 4833 bytes to sql.py